[M_IrisHUB_WalkTheDog MissionDefinition]
MissionSummary="Walk Tina's ''dog''."

[M_IrisHUB_WalkTheDog:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Tiny Tina needs you to take her ''dog'', Enrique, out for a walk. <br><br>Enrique, as it turns out, is a bloodthirsty beast who will rip your throat out if you give him the chance. In order to take him for a walk, you'll have to sprint ahead of him and lead him to some of his favorite spots.<br><br>Try not to get eaten."
